Revit 2024 API
RevitLinkGraphicsSettings Class
 Settings to override display of Revit link in a view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public class RevitLinkGraphicsSettings : IDisposable
Visual Basic
Public Class RevitLinkGraphicsSettings _
	Implements IDisposable
Visual C++
public ref class RevitLinkGraphicsSettings : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RevitLinkGraphicsSettings
See Also
RevitLinkGraphicsSettings Members
Autodesk.Revit.DB Namespace